packages/domain/src/sgp-lifted/esocial-worker/submission/__fixtures__/ws-enviar-lote-eventos.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<wsdl:definitions
  xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
  xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/"
  xmlns:xsd="http://www.w3.org/2001/XMLSchema"
  xmlns:tns="http://www.esocial.gov.br/servicos/empregador/lote/eventos/envio/v1_1_0"
  targetNamespace="http://www.esocial.gov.br/servicos/empregador/lote/eventos/envio/v1_1_0">
  <wsdl:types>
    <xsd:schema
      elementFormDefault="qualified"
      targetNamespace="http://www.esocial.gov.br/servicos/empregador/lote/eventos/envio/v1_1_0">
      <xsd:element name="EnviarLoteEventos">
        <xsd:complexType>
          <xsd:sequence>
            <xsd:element name="loteEventos" minOccurs="1" maxOccurs="1">
              <xsd:complexType mixed="true">
                <xsd:sequence>
                  <xsd:any minOccurs="0" maxOccurs="unbounded" processContents="lax" />
                </xsd:sequence>
              </xsd:complexType>
            </xsd:element>
          </xsd:sequence>
        </xsd:complexType>
      </xsd:element>
      <xsd:element name="EnviarLoteEventosResponse">
        <xsd:complexType>
          <xsd:sequence>
            <xsd:element name="EnviarLoteEventosResult" minOccurs="0">
              <xsd:complexType mixed="true">
                <xsd:sequence>
                  <xsd:any minOccurs="0" maxOccurs="unbounded" processContents="lax" />
                </xsd:sequence>
              </xsd:complexType>
            </xsd:element>
          </xsd:sequence>
        </xsd:complexType>
      </xsd:element>
    </xsd:schema>
  </wsdl:types>
  <wsdl:message name="EnviarLoteEventosInput">
    <wsdl:part name="parameters" element="tns:EnviarLoteEventos" />
  </wsdl:message>
  <wsdl:message name="EnviarLoteEventosOutput">
    <wsdl:part name="parameters" element="tns:EnviarLoteEventosResponse" />
  </wsdl:message>
  <wsdl:portType name="ServicoEnviarLoteEventos">
    <wsdl:operation name="EnviarLoteEventos">
      <wsdl:input message="tns:EnviarLoteEventosInput" />
      <wsdl:output message="tns:EnviarLoteEventosOutput" />
    </wsdl:operation>
  </wsdl:portType>
  <wsdl:binding name="ServicoEnviarLoteEventosSoap" type="tns:ServicoEnviarLoteEventos">
    <soap:binding transport="http://schemas.xmlsoap.org/soap/http" style="document" />
    <wsdl:operation name="EnviarLoteEventos">
      <soap:operation soapAction="http://www.esocial.gov.br/servicos/empregador/lote/eventos/envio/v1_1_0/ServicoEnviarLoteEventos/EnviarLoteEventos" style="document" />
      <wsdl:input>
        <soap:body use="literal" />
      </wsdl:input>
      <wsdl:output>
        <soap:body use="literal" />
      </wsdl:output>
    </wsdl:operation>
  </wsdl:binding>
  <wsdl:service name="ServicoEnviarLoteEventos">
    <wsdl:port name="ServicoEnviarLoteEventosSoap" binding="tns:ServicoEnviarLoteEventosSoap">
      <soap:address location="http://127.0.0.1:0/WsEnviarLoteEventos.svc" />
    </wsdl:port>
  </wsdl:service>
</wsdl:definitions>
