docs/release/1.0.0/soap/submit-request.xml

<?xml version="1.0" encoding="UTF-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:esoc="http://www.esocial.gov.br/servicos/empregador/lote/eventos/envio/v1_1_0"><soap:Header/><soap:Body><esoc:EnviarLoteEventos><esoc:loteEventos><?xml version="1.0" encoding="UTF-8"?>
<eSocial xmlns="http://www.esocial.gov.br/schema/evt/evtFechaEvPer/v_S_01_03_00">
  <evtFechaEvPer Id="ID3409944475143212543041043634453544">
    <ideEvento><indApuracao>1</indApuracao><perApur>2026-01</perApur><tpAmb>2</tpAmb><procEmi>1</procEmi><verProc>SGP-0.0.1</verProc></ideEvento>
    <ideEmpregador><tpInsc>1</tpInsc><nrInsc>12345678</nrInsc></ideEmpregador>
    <infoFech>
      <evtRemun>S</evtRemun>
      <evtPgtos>S</evtPgtos>
      <evtComProd>N</evtComProd>
      <evtContratAvNP>N</evtContratAvNP>
      <evtInfoComplPer>N</evtInfoComplPer>
    </infoFech>
  </evtFechaEvPer>
<ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#"><ds:SignedInfo><ds:CanonicalizationMethod Algorithm="LOCAL-DETERMINISTIC-C14N"/><ds:SignatureMethod Algorithm="LOCAL-DETERMINISTIC-SHA256"/><ds:Reference URI=""><ds:DigestMethod Algorithm="http://www.w3.org/2001/04/xmlenc#sha256"/><ds:DigestValue>175f510a7cc2bb5e540ca4e79a3a01e58ff723e98ec569da1f9599191888b3dd</ds:DigestValue></ds:Reference></ds:SignedInfo><ds:SignatureValue>e74b534f94f0f35200fd6c443494537e7d5e5e2de6f8e2bec20f74ca0c9f0c52</ds:SignatureValue><ds:KeyInfo><ds:KeyName>365816d974f98f56c2f943953f8b49bfc83037705235bc0da0f15f755404f0c3</ds:KeyName></ds:KeyInfo></ds:Signature></eSocial>
</esoc:loteEventos></esoc:EnviarLoteEventos></soap:Body></soap:Envelope>