tests/fixtures/xml/env_evtAdmPrelim.xml

<soapenv:Envelope xmlns:soapenv = "http://schemas.xmlsoap.org/soap/envelope/" xmlns:v1 = "http://www.esocial.gov.br/servicos/empregador/lote/eventos/envio/v1_1_0" ><soapenv:Header/><soapenv:Body><v1:EnviarLoteEventos><v1:loteEventos><eSocial xmlns="http://www.esocial.gov.br/schema/lote/eventos/envio/v1_1_0" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"><envioLoteEventos grupo="2"><ideEmpregador><tpInsc>1</tpInsc><nrInsc>99999999999999</nrInsc></ideEmpregador><ideTransmissor><tpInsc>1</tpInsc><nrInsc>99999999999999</nrInsc></ideTransmissor><eventos><evento Id="ID1999999999999992017080218450800001"><eSocial xmlns="http://www.esocial.gov.br/schema/evt/evtAdmPrelim/v02_03_00" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"><evtAdmPrelim Id="ID1999999999999992017080218450800001"><ideEvento><tpAmb>2</tpAmb><procEmi>1</procEmi><verProc>2_3_00</verProc></ideEvento><ideEmpregador><tpInsc>1</tpInsc><nrInsc>99999999999999</nrInsc></ideEmpregador><infoRegPrelim><cpfTrab>00232133417</cpfTrab><dtNascto>1931-02-12</dtNascto><dtAdm>2017-02-12</dtAdm></infoRegPrelim></evtAdmPrelim></eSocial></evento></eventos></envioLoteEventos></eSocial></v1:loteEventos></v1:EnviarLoteEventos></soapenv:Body></soapenv:Envelope>